In [1]:
import pandas as pd
import numpy as np

In [2]:
sozlukVerisi = {"istanbul" : [30,20,np.nan],"ankara" : [20,np.nan,25],"izmir" : [40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [3]:
havaDurumuDataFrame

   istanbul  ankara  izmir
0      30.0    20.0     40
1      20.0     NaN     39
2       NaN    25.0     38

In [4]:
havaDurumuDataFrame.dropna()

   istanbul  ankara  izmir
0      30.0    20.0     40

In [5]:
havaDurumuDataFrame

   istanbul  ankara  izmir
0      30.0    20.0     40
1      20.0     NaN     39
2       NaN    25.0     38

In [6]:
havaDurumuDataFrame.dropna(axis = 1)

   izmir
0     40
1     39
2     38

In [8]:
yeniVeri = {"istanbul" : [30,20,np.nan],"ankara" : [20,np.nan,25],"izmir" : [40,39,38] ,"antalya" :[45,np.nan,np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeri)

In [9]:
yeniDataFrame

   istanbul  ankara  izmir  antalya
0      30.0    20.0     40     45.0
1      20.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [10]:
yeniDataFrame.dropna(axis = 1 ,thresh=2)

   istanbul  ankara  izmir
0      30.0    20.0     40
1      20.0     NaN     39
2       NaN    25.0     38

In [11]:
yeniDataFrame

   istanbul  ankara  izmir  antalya
0      30.0    20.0     40     45.0
1      20.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [12]:
yeniDataFrame.fillna(20)

   istanbul  ankara  izmir  antalya
0      30.0    20.0     40     45.0
1      20.0    20.0     39     20.0
2      20.0    25.0     38     20.0

## groupby

In [23]:
maasSozlugu = {"departmanlar" : ["yazilim","yazilim","pazarlama","pazarlama","hukuk","hukuk"],
              "calısan ismi": ["ahmet","mehmet","atıl","burak","zeynep","fatma"],
              "maas" : [100,200,300,400,500,600]}

In [24]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [25]:
maasDataFrame

  departmanlar calısan ismi  maas
0      yazilim        ahmet   100
1      yazilim       mehmet   200
2    pazarlama         atıl   300
3    pazarlama        burak   400
4        hukuk       zeynep   500
5        hukuk        fatma   600

In [29]:
grupObjesi = maasDataFrame.groupby("departmanlar")

In [30]:
grupObjesi.count()

              calısan ismi  maas
departmanlar
hukuk                    2     2
pazarlama                2     2
yazilim                  2     2

In [31]:
grupObjesi.mean()

              maas
departmanlar
hukuk          550
pazarlama      350
yazilim        150

In [32]:
grupObjesi.min()

             calısan ismi  maas
departmanlar
hukuk               fatma   500
pazarlama            atıl   300
yazilim             ahmet   100

In [33]:
grupObjesi.max()

             calısan ismi  maas
departmanlar
hukuk              zeynep   600
pazarlama           burak   400
yazilim            mehmet   200

In [34]:
grupObjesi.describe()

              maas
             count   mean        std    min    25%    50%    75%    max
departmanlar
hukuk          2.0  550.0  70.710678  500.0  525.0  550.0  575.0  600.0
pazarlama      2.0  350.0  70.710678  300.0  325.0  350.0  375.0  400.0
yazilim        2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0